{"class_name": "Model", "config": {"input_layers": [["lwir_in", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "name": "lwir_in", "sparse": false, "batch_input_shape": [null, 256, 320, 1]}, "name": "lwir_in", "inbound_nodes": []}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_1", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_1", "inbound_nodes": [[["lwir_in", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_size": [4, 4], "strides": [2, 2], "data_format": "channels_last", "filters": 32, "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_1", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_2", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_2", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_size": [4, 4], "strides": [2, 2], "data_format": "channels_last", "filters": 64, "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_2", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_1", "momentum": 0.99, "axis": 1, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_3", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_3", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_size": [4, 4], "strides": [1, 1], "data_format": "channels_last", "filters": 128, "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_3", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_2", "momentum": 0.99, "axis": 1, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_4", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_4", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_size": [4, 4], "strides": [1, 1], "data_format": "channels_last", "filters": 128, "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_4", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_3", "momentum": 0.99, "axis": 1, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_5", "alpha": 0.0}, "name": "leaky_re_lu_5", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_size": [4, 4], "strides": [1, 1], "data_format": "channels_last", "filters": 128, "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_5", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_4", "momentum": 0.99, "axis": 1, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_1"}, "name": "dropout_1", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "name": "concatenate_1", "inbound_nodes": [[["dropout_1", 0, 0, {}], ["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_6", "alpha": 0.0}, "name": "leaky_re_lu_6", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_6", "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_size": [4, 4], "strides": [1, 1], "data_format": "channels_last", "filters": 128, "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_6", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_5", "momentum": 0.99, "axis": 1, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_2"}, "name": "dropout_2", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_2", "axis": -1}, "name": "concatenate_2", "inbound_nodes": [[["dropout_2", 0, 0, {}], ["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_7", "alpha": 0.0}, "name": "leaky_re_lu_7", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "up_sampling2d_1", "size": [2, 2], "data_format": "channels_last"}, "name": "up_sampling2d_1", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_7", "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_size": [4, 4], "strides": [1, 1], "data_format": "channels_last", "filters": 64, "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_7", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_6", "momentum": 0.99, "axis": 1, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_3"}, "name": "dropout_3", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_3", "axis": -1}, "name": "concatenate_3", "inbound_nodes": [[["dropout_3", 0, 0, {}], ["conv2d_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_8", "alpha": 0.0}, "name": "leaky_re_lu_8", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "up_sampling2d_2", "size": [2, 2], "data_format": "channels_last"}, "name": "up_sampling2d_2", "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_8", "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_size": [4, 4], "strides": [1, 1], "data_format": "channels_last", "filters": 32, "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_8", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_7", "momentum": 0.99, "axis": 1, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_4"}, "name": "dropout_4", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "lab_out_1", "kernel_constraint": null, "activation": "sigmoid", "bias_regularizer": null, "kernel_size": [4, 4], "strides": [1, 1], "data_format": "channels_last", "filters": 3, "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "lab_out_1", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}], "output_layers": [["lab_out_1", 0, 0]]}, "keras_version": "2.0.8", "backend": "tensorflow"}